sensmonitor/smonitor-iot/examples/lilygo_sim7670_s3/sdkconfig.defaults
# LilyGO T-SIM7670G S3 board profile
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SMONITOR_BOARD_LILYGO_T_SIM7670_S3=y

# T-SIM7670G-S3 variants can ship with Quad PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

# T-SIM7670G-S3 Standard does not use the T-SIM7000G battery ADC divider.
# CONFIG_SMONITOR_BATTERY_ENABLE is not set

# SIM7670G is LTE Cat-1 with GNSS. It does not support GSM/GPRS,
# LTE-M or NB-IoT.
CONFIG_SMONITOR_MODEM_PROFILE_SIM7670=y
CONFIG_SMONITOR_MODEM_NETWORK_LTE=y

# Modem UART wiring from the LilyGO T-SIM7670G-S3 Standard pinout.
CONFIG_SMONITOR_BOARD_MODEM_UART_TX_PIN=4
CONFIG_SMONITOR_BOARD_MODEM_UART_RX_PIN=5
CONFIG_SMONITOR_BOARD_MODEM_UART_RTS_PIN=-1
CONFIG_SMONITOR_BOARD_MODEM_UART_CTS_PIN=-1
CONFIG_SMONITOR_BOARD_MODEM_PWRKEY_PIN=46
CONFIG_SMONITOR_BOARD_MODEM_UART_BAUD_RATE=115200
CONFIG_SMONITOR_BOARD_MODEM_UART_RX_BUFFER_SIZE=4096
CONFIG_SMONITOR_BOARD_MODEM_UART_TX_BUFFER_SIZE=2048

# External sensor I2C defaults aligned with the T-SIM7080 S3 profile for
# hardware testing on the current board.
CONFIG_SMONITOR_I2C_PORT=0
CONFIG_SMONITOR_I2C_SDA_PIN=13
CONFIG_SMONITOR_I2C_SCL_PIN=21
CONFIG_SMONITOR_I2C_INTERNAL_PULLUPS=y
